[
  {
    "id": "intro-blockchain-2024",
    "titulo": "Introducción a Blockchain en la UNAM: El Comienzo de una Nueva Era",
    "autor": "CriptoUNAM",
    "fecha": "2024-09-15",
    "imagen": "/images/cursos/1.svg",
    "tags": [
      "Blockchain",
      "Educación",
      "UNAM"
    ],
    "contenido": "# El Despertar de la Blockchain en la Universidad Nacional\n\nLa tecnología blockchain ha dejado de ser una simple \"moda pasajera\" para convertirse en la columna vertebral de la próxima generación de internet. En la Universidad Nacional Autónoma de México (UNAM), reconocemos la importancia crítica de preparar a nuestros estudiantes para esta revolución tecnológica. **CriptoUNAM** nace con esa misión: ser el puente entre la academia y el ecosistema Web3.\n\n## Más allá de Bitcoin\n\nCuando escuchamos \"blockchain\", es inevitable pensar en Bitcoin y criptomonedas. Sin embargo, en CriptoUNAM queremos ampliar esa visión. La tecnología de cadena de bloques representa un cambio de paradigma en cómo manejamos la **confianza digital**.\n\n> \"La blockchain es una máquina de confianza. Permite que personas que no se conocen colaboren sin necesidad de un intermediario central.\"\n\n### Nuestros Pilares Educativos\n\nPara este ciclo 2024-2025, hemos diseñado un programa integral que abarca desde lo básico hasta lo avanzado:\n\n1.  **Alfabetización Cripto:** Talleres de \"Mi primera wallet\" para entender la custodia personal, la seguridad y las llaves privadas.\n2.  **Desarrollo Técnico:** Cursos de programación en Solidity y Rust para aquellos ingenieros que deseen construir la infraestructura del futuro.\n3.  **Investigación Académica:** Fomentamos tesis y proyectos de investigación que exploren el impacto sociopolítico y económico de la descentralización en México.\n\n## ¿Por qué ahora?\n\nMéxico es uno de los países líderes en adopción de criptomonedas en Latinoamérica. Según informes de **Chainalysis**, el envío de remesas y la necesidad de servicios financieros alternativos impulsan el uso real de esta tecnología. La UNAM, como máxima casa de estudios, tiene la responsabilidad de liderar la discusión técnica y ética sobre estas herramientas.\n\nTe invitamos a sumarte a nuestros próximos eventos. No importa si estudias Ingeniería, Derecho, Economía o Artes; la Web3 es multidisciplinaria y necesita de todos los talentos.\n\n### Fuentes y Lecturas Recomendadas\n*   [Chainalysis: The 2024 Geography of Cryptocurrency Report](https://www.chainalysis.com/blog/latin-america-cryptocurrency-adoption/)\n*   [Bitcoin Whitepaper (Español)](https://bitcoin.org/files/bitcoin-paper/bitcoin_es_latam.pdf)"
  },
  {
    "id": "fundamentos-blockchain-2024",
    "titulo": "Fundamentos de Blockchain: Entendiendo la Tecnología Detrás del Hype",
    "autor": "CriptoUNAM",
    "fecha": "2024-10-01",
    "imagen": "/images/blog/blockchain-intro.png",
    "tags": [
      "Blockchain",
      "Educación",
      "Tecnología"
    ],
    "contenido": "# Descifrando la Cadena de Bloques\n\nEs común perderse entre términos como *hash*, *nodo*, *consenso* y *token*. Pero, ¿qué es realmente una blockchain? En términos simples, es un libro mayor de contabilidad (ledger) que es **compartido, inmutable y verificable**. A diferencia de una base de datos tradicional controlada por un banco o una empresa (como Facebook o Google), una blockchain vive en miles de computadoras alrededor del mundo al mismo tiempo.\n\n## Los Tres Pilares de la Blockchain\n\nPara entender por qué esta tecnología es revolucionaria, debemos analizar sus tres características fundamentales:\n\n### 1. Descentralización\nEn una red centralizada, si el servidor principal falla, todo el sistema cae. En una blockchain, la información está replicada en miles de nodos. Si un nodo se desconecta, la red sigue funcionando sin problemas. Esto la hace increíblemente resistente a censura y ataques.\n\n### 2. Inmutabilidad\nUna vez que un dato se escribe en un bloque y este se añade a la cadena, es matemáticamente casi imposible modificarlo. Esto se logra mediante **criptografía**. Cada bloque contiene una \"huella digital\" (hash) del bloque anterior. Si alguien intenta cambiar un dato de hace 5 años, tendría que recalcular toda la cadena desde entonces, lo cual requeriría una energía computacional inmensa.\n\n### 3. Transparencia\nAunque la identidad de los usuarios puede ser pseudónima (representada por direcciones alfanuméricas), todas las transacciones son públicas. Cualquiera puede auditar la red en tiempo real usando exploradores de bloques como [Etherscan](https://etherscan.io/) o [Mempool.space](https://mempool.space/).\n\n## ¿Por qué es relevante para un estudiante de la UNAM?\n\nLa blockchain no solo sirve para dinero digital. Sus aplicaciones son vastas:\n*   **Identidad Digital:** Credenciales académicas infalsificables (Soulbound Tokens).\n*   **Cadenas de Suministro:** Trazabilidad total de alimentos y medicinas.\n*   **Gobernanza:** Sistemas de votación transparentes y a prueba de fraude.\n\n> \"Blockchain es al valor lo que el protocolo TCP/IP fue a la información. Estamos construyendo las carreteras del futuro financiero.\"\n\nNo te quedes fuera de esta transformación. Aprender los fundamentos hoy te dará una ventaja competitiva enorme en el mercado laboral de la próxima década.\n\n### Referencias\n*   [Anders Brownworth: Blockchain Demo (Visual)](https://andersbrownworth.com/blockchain/)\n*   [Ethereum Foundation: Introduction to Blockchain](https://ethereum.org/en/developers/docs/intro-to-ethereum/)"
  },
  {
    "id": "defi-fundamentals-workshop",
    "titulo": "Workshop DeFi: Revolucionando las Finanzas desde la UNAM",
    "autor": "CriptoUNAM",
    "fecha": "2024-03-22",
    "imagen": "/images/cursos/3.svg",
    "tags": [
      "DeFi",
      "Ethereum",
      "Educación"
    ],
    "contenido": "# Finanzas Sin Bancos: Resumen del Workshop DeFi\n\nEl pasado 22 de marzo, el Auditorio Ho Chi Minh de la Facultad de Economía fue testigo de una discusión profunda sobre el futuro del dinero. Nuestro workshop de **Fundamentos de Finanzas Descentralizadas (DeFi)** reunió a estudiantes de economía e ingeniería para explorar cómo los protocolos abiertos están desafiando a la banca tradicional.\n\n## ¿Qué aprendimos?\n\nEl taller se centró en desmitificar los componentes clave del ecosistema DeFi en Ethereum. A diferencia de las FinTech (que simplemente digitalizan procesos bancarios tradicionales), DeFi construye un sistema financiero totalmente nuevo desde cero.\n\n### Temas Clave:\n\n1.  **DEXs (Exchanges Descentralizados):**\n    Analizamos el funcionamiento de **Uniswap** y el modelo de *Automated Market Maker* (AMM). Explicamos la fórmula constante de producto ($x * y = k$) que permite el intercambio de activos sin necesidad de un libro de órdenes centralizado.\n\n2.  **Lending & Borrowing:**\n    Exploramos protocolos como **Aave**, donde los usuarios pueden depositar activos para ganar interés o pedir préstamos sobrecolateralizados sin burocracia ni aprobación de crédito. ¡Todo gestionado por código!\n\n3.  **Stablecoins:**\n    La importancia de monedas como DAI o USDC para mantener la estabilidad en un mercado volátil. Discutimos la diferencia entre stablecoins centralizadas (respaldadas por fiat en un banco) y descentralizadas (respaldadas por criptoactivos on-chain).\n\n## La Práctica hace al Maestro\n\nLos asistentes no solo escucharon teoría; realizaron su primer *swap* en una testnet y aprendieron a interactuar con un contrato inteligente de préstamo.\n\n> \"DeFi permite que cualquier persona con conexión a internet acceda a servicios financieros globales. Es la democratización total del capital.\"\n\nSi te perdiste este evento, no te preocupes. Estamos preparando una segunda edición con temas más avanzados como *Yield Farming* y *Flash Loans*. Mantente atento a nuestras redes.\n\n### Recursos del Taller\n*   [Uniswap Whitepaper v2](https://uniswap.org/whitepaper.pdf)\n*   [Aave Documentation](https://docs.aave.com/hub/)\n*   [DefiLlama (Analytics)](https://defillama.com/)"
  },
  {
    "id": "intro-smart-contracts-solidity",
    "titulo": "Tu Primer Smart Contract: Programando la Confianza con Solidity",
    "autor": "DevTeam CriptoUNAM",
    "fecha": "2024-10-15",
    "imagen": "/images/blog/smart-contracts.png",
    "tags": [
      "Blockchain",
      "Programación",
      "Solidity",
      "Ethereum"
    ],
    "contenido": "# El Código es la Ley: Introducción a Solidity\n\nLos **Smart Contracts** (contratos inteligentes) son la pieza fundamental que hace a Ethereum \"programable\". A diferencia de Bitcoin, que es principalmente una calculadora de transacciones, Ethereum es una computadora mundial (EVM - Ethereum Virtual Machine). Y el lenguaje principal para hablarle a esta computadora es **Solidity**.\n\n## ¿Qué es un Smart Contract?\n\nEs un programa que vive en la blockchain y se ejecuta exactamente como fue programado. No puede ser detenido, censurado ni modificado (generalmente) una vez desplegado. Esto permite crear reglas de negocio que se auto-ejecutan sin necesidad de confiar en una contraparte humana.\n\n## Tu Primer \"Hola Mundo\" en Web3\n\nPara empezar, no necesitas instalar nada complejo. Herramientas como [Remix IDE](https://remix.ethereum.org) te permiten escribir, compilar y desplegar contratos desde tu navegador.\n\n### Estructura Básica\n\nAnalicemos un contrato simple de almacenamiento:\n\n```solidity\n// SPDX-License-Identifier: MIT\npragma solidity ^0.8.0;\n\ncontract AlmacenamientoSimple {\n    // Variable de estado: se guarda permanentemente en la blockchain\n    uint256 private dato;\n\n    // Evento para notificar al frontend cuando algo cambia\n    event DatoCambiado(uint256 nuevoValor);\n\n    // Función para guardar un valor (cuesta Gas)\n    function guardar(uint256 _nuevoDato) public {\n        dato = _nuevoDato;\n        emit DatoCambiado(_nuevoDato);\n    }\n\n    // Función para leer el valor (gratis, no cuesta Gas)\n    function leer() public view returns (uint256) {\n        return dato;\n    }\n}\n```\n\n### Conceptos Críticos\n\n*   **Gas:** Cada operación de escritura en Ethereum cuesta \"gas\" (pagado en ETH). Esto evita bucles infinitos y spam en la red.\n*   **Visibilidad (public, private, view):** Define quién puede llamar a la función y si modifica el estado.\n*   **Tipos de Datos:** `uint256` (entero sin signo), `address` (dirección de wallet), `mapping` (diccionarios).\n\n## ¿Cómo aprender más?\n\nLa curva de aprendizaje puede ser empinada, pero los recursos son abundantes. En CriptoUNAM recomendamos empezar por **CryptoZombies**, un curso interactivo donde aprendes a construir un juego en Solidity.\n\n> \"Ser desarrollador de Smart Contracts es como programar cohetes: si cometes un error, el costo puede ser astronómico. La seguridad y la auditoría son primordiales.\"\n\n### Recursos para Desarrolladores\n*   [Documentación Oficial de Solidity](https://docs.soliditylang.org/)\n*   [CryptoZombies](https://cryptozombies.io/)\n*   [OpenZeppelin Contracts (Estándares de Seguridad)](https://www.openzeppelin.com/contracts)"
  },
  {
    "id": "bitcoin-day-2024",
    "titulo": "Bitcoin Day en FES Acatlán: Innovación y Comunidad",
    "autor": "CriptoUNAM",
    "fecha": "2024-05-07",
    "imagen": "/images/Comunidad/_DSC0118 (1).jpg",
    "tags": [
      "Bitcoin",
      "Eventos",
      "Web3"
    ],
    "contenido": "# Celebrando al Rey: Relatoría del Bitcoin Day\n\nEl pasado 7 de mayo, la FES Acatlán se pintó de naranja. El **Bitcoin Day** fue un evento hito para nuestra comunidad, reuniendo a expertos, desarrolladores y curiosos para hablar sobre la criptomoneda que inició todo.\n\n## Más allá de la Reserva de Valor\n\nAunque muchos ven a Bitcoin solo como \"oro digital\", el evento se centró en las innovaciones técnicas que están ocurriendo sobre la red.\n\n### Charlas Destacadas\n\n1.  **La Revolución de Lightning Network:**\n    Discutimos cómo la capa 2 de Bitcoin permite micropagos instantáneos y casi gratuitos. Vimos una demo en vivo comprando un café usando Lightning, demostrando que Bitcoin sí puede ser un medio de pago eficiente para el día a día.\n\n2.  **Ordinals y BRC-20:**\n    El polémico pero fascinante mundo de los \"NFTs en Bitcoin\". Explicamos cómo la actualización *Taproot* permitió inscribir datos arbitrarios en satoshis individuales, abriendo una nueva economía de coleccionables digitales directamente en la blockchain de Bitcoin.\n\n3.  **Bitcoin y Energía:**\n    Desmitificamos el impacto ambiental. Se presentaron datos sobre cómo la minería de Bitcoin está incentivando el uso de energías renovables y estabilizando redes eléctricas al actuar como un comprador de energía de último recurso.\n\n## Networking y Comunidad\n\nLo más valioso fue ver a estudiantes de diferentes carreras debatiendo. Desde filósofos cuestionando la naturaleza del dinero, hasta ingenieros revisando el código de Bitcoin Core.\n\n> \"Bitcoin es la separación del dinero y el Estado. Entender esto es crucial para la soberanía individual en el siglo XXI.\"\n\nAgradecemos a **Bitcoin Monks** y a todos los patrocinadores por hacer posible este evento. ¡La adopción estudiantil está más fuerte que nunca!\n\n### Fuentes Consultadas\n*   [Lightning Network Whitepaper](https://lightning.network/lightning-network-paper.pdf)\n*   [Bitcoin Mining Council: Q4 2023 Report](https://bitcoinminingcouncil.com/)"
  },
  {
    "id": "frontend-dapps-web3",
    "titulo": "Frontend para dApps: La Guía Definitiva para Conectar Web3 con React",
    "autor": "DevTeam CriptoUNAM",
    "fecha": "2024-11-01",
    "imagen": "/images/blog/frontend-dapps.png",
    "tags": [
      "Web3",
      "Frontend",
      "React",
      "Programación"
    ],
    "contenido": "# El Puente hacia la Blockchain: Desarrollo Frontend Web3\n\nConstruir un Smart Contract es solo la mitad de la batalla. Para que los usuarios normales puedan usar tu aplicación, necesitas una interfaz web amigable. Aquí es donde el desarrollo Frontend tradicional (React, Vue) se encuentra con el mundo Web3.\n\n## El Stack Moderno de Web3\n\nOlvídate de inyectar `Web3.js` manualmente. En 2024, las herramientas han madurado para ofrecer una experiencia de desarrollador (DX) increíble.\n\n### 1. Wagmi (We Are Gonna Make It)\nEs una colección de **React Hooks** que simplifican enormemente la interacción con Ethereum. Hacen todo el trabajo sucio: caché, gestión de estado de la wallet, y recarga automática de datos.\n\n```tsx\nimport { useAccount, useBalance } from 'wagmi'\n\nfunction PerfilUsuario() {\n  const { address, isConnected } = useAccount()\n  const { data } = useBalance({ address })\n\n  if (isConnected) return <div>Conectado: {address} - Saldo: {data?.formatted} ETH</div>\n  return <div>Por favor conecta tu wallet</div>\n}\n```\n\n### 2. Viem\nEs el reemplazo moderno de Ethers.js. Es una librería de bajo nivel, ultraligera y tipada con TypeScript, que maneja las llamadas JSON-RPC. Es el motor que impulsa a Wagmi.\n\n### 3. RainbowKit / ConnectKit\nYa no tienes que construir de cero el modal de \"Connect Wallet\". Estas librerías te dan componentes UI hermosos y listos para usar que soportan MetaMask, WalletConnect, Coinbase Wallet y más.\n\n## Retos del Frontend Web3\n\nDesarrollar para blockchain tiene desafíos únicos que no existen en Web2:\n*   **Gestión de Redes:** Tu app debe saber si el usuario está en Mainnet, Sepolia o Polygon, y pedirle que cambie de red si es necesario.\n*   **Latencia y Finalidad:** Las transacciones no son instantáneas. Debes diseñar UIs que manejen estados de \"Pendiente\", \"Confirmado\" y \"Fallido\" de forma elegante (Toast notifications son tus mejores amigas).\n*   **Lectura de BigInts:** En Solidity, los números pueden ser enormes (256 bits). JavaScript no los maneja nativamente bien, por lo que usaremos `BigInt` frecuentemente.\n\n> \"Una gran dApp no se siente como una dApp. Se siente como una app normal, pero con superpoderes de propiedad digital.\"\n\n### Tutoriales Recomendados\n*   [Documentación de Wagmi](https://wagmi.sh/)\n*   [RainbowKit Docs](https://www.rainbowkit.com/docs/introduction)\n*   [Scaffold-ETH 2](https://scaffoldeth.io/) (El mejor starter kit)"
  },
  {
    "id": "ethereum-verge-upgrade",
    "titulo": "La Próxima Actualización de Ethereum: The Verge y el Futuro Stateless",
    "autor": "Equipo Técnico CriptoUNAM",
    "fecha": "2025-09-15",
    "imagen": "/images/ethereum-verge.png",
    "tags": [
      "Ethereum",
      "Tecnología",
      "Blockchain"
    ],
    "contenido": "# Ethereum Rumbo a la Eficiencia Máxima: Entendiendo The Verge \n\nLa evolución de Ethereum no se detuvo con el \"Merge\" (cuando pasamos a Proof-of-Stake). Según el roadmap actualizado de Vitalik Buterin, nos acercamos a una fase crítica: **The Verge**. Esta actualización promete resolver uno de los mayores cuellos de botella de la blockchain: el crecimiento desmedido de los datos que los validadores deben almacenar.\n\n## El Problema del Estado (State Bloat)\n\nActualmente, para ser un validador completo en Ethereum, necesitas almacenar cientos de gigabytes de datos históricos y el \"estado\" actual (cuentas, saldos, contratos). Esto centraliza la red, ya que solo personas con hardware potente y discos SSD grandes pueden participar.\n\n## La Solución: Verkle Trees\n\nAquí entra la magia de **The Verge**. Su núcleo es la implementación de **Verkle Trees** (una evolución matemática de los Merkle Trees).\n\n### ¿Qué permiten los Verkle Trees?\nPermiten \"pruebas\" (proofs) mucho más pequeñas. Esto habilita los **Stateless Clients** (Clientes Sin Estado). En el futuro, un validador no necesitará tener *todo* el estado de Ethereum en su disco duro. Podrá recibir un bloque junto con una \"prueba\" criptográfica de que los datos son correctos, verificarla en milisegundos y aprobar el bloque.\n\n> \"El objetivo es que sea posible verificar la cadena de Ethereum desde un teléfono móvil o incluso un reloj inteligente. Esa es la verdadera descentralización.\" — Vitalik Buterin\n\n## Impacto en el Ecosistema\n\n1.  **Mayor Descentralización:** Al bajar los requisitos de hardware (disco duro), más usuarios domésticos podrán correr nodos validadores (Solo Staking).\n2.  **Sincronización Instantánea:** Los nuevos nodos podrán unirse a la red casi al instante, sin esperar días para descargar la historia de la cadena.\n3.  **Preparación para zk-EVM:** Los Verkle Trees son más amigables con la criptografía de conocimiento cero (Zero-Knowledge), allanando el camino para futuras mejoras de privacidad y escalabilidad.\n\nEsta actualización, prevista para finales de 2025 o inicios de 2026, marcará el fin de la era del \"hardware pesado\" para Ethereum.\n\n### Fuentes Reales y Roadmap\n*   [Ethereum Roadmap: The Verge](https://ethereum.org/en/roadmap/verge/)\n*   [Vitalik Buterin: Endgame (Blog)](https://vitalik.eth.limo/general/2021/12/06/endgame.html)\n*   [EIP-6800: Ethereum Improvement Proposal for Verkle Trees](https://eips.ethereum.org/EIPS/eip-6800)"
  },
  {
    "id": "recap-hackathon-2025",
    "titulo": "Resumen: Hackathon CriptoUNAM 2025 - Rompiendo Récords",
    "autor": "Comunidad CriptoUNAM",
    "fecha": "2025-10-20",
    "imagen": "/images/hackathon-2025.png",
    "tags": [
      "Comunidad",
      "Hackathon",
      "Eventos"
    ],
    "contenido": "# 48 Horas de Innovación: Recap del Hackathon CriptoUNAM 2025\n\nEl pasado fin de semana, los pasillos de la Facultad de Ingeniería se transformaron en el epicentro de la innovación Web3 en México. Con más de **300 participantes** registrados, el **Hackathon CriptoUNAM 2025** no solo fue nuestro evento más grande hasta la fecha, sino una demostración contundente del talento que existe en nuestra universidad.\n\n## El Reto\n\nLos estudiantes tuvieron 48 horas para construir soluciones funcionales en tres tracks principales:\n1.  **DeFi Institucional:** Protocolos que cumplan con regulación pero mantengan la esencia descentralizada.\n2.  **Impacto Social y DAOs:** Herramientas para mejorar la gobernanza en comunidades locales.\n3.  **Infraestructura:** Mejoras en capas 2 y herramientas de privacidad (Privacy Pools).\n\n## Proyectos Ganadores\n\nLa calidad del código fue excepcional. Los jueces, provenientes de empresas líderes como **StarkWare**, **Consensys** y **Bitso**, tuvieron una tarea difícil.\n\n### 🥇 1er Lugar: EcoSwap (Track DeFi)\nUn *Automated Market Maker* (AMM) diseñado específicamente para el comercio de bonos de carbono tokenizados. Utiliza oráculos de **Chainlink** para verificar datos satelitales de reforestación en tiempo real antes de liberar los fondos.\n*   *Premio:* $5,000 USD y auditoría gratuita de código.\n\n### 🥈 2do Lugar: UNAM-DAO (Track Social)\nUn sistema de votación cuadrática para la asignación de presupuestos en facultades. Utiliza pruebas de conocimiento cero (ZK-Proofs) para garantizar que el voto sea anónimo pero verificable, asegurando que solo alumnos activos puedan participar.\n\n### 🥉 3er Lugar: CertiChain (Track Infra)\nUna solución de identidad soberana (DID) para emitir títulos universitarios que son verificables instantáneamente por empleadores globales, cumpliendo con el estándar W3C.\n\n> \"Lo que vimos este fin de semana no son solo proyectos escolares; son startups en potencia listas para recibir inversión.\" — Juez invitado de VCs Latam.\n\n¡Gracias a todos los mentores, voluntarios y patrocinadores! Nos vemos en la edición 2026.\n\n### Enlaces del Evento\n*   [Repositorio de Proyectos (GitHub)](https://github.com/CriptoUNAM/Hackathon-2025-Projects)\n*   [Galería de Fotos Oficial](https://instagram.com/criptounam)"
  },
  {
    "id": "defi-regulation-2025",
    "titulo": "Actualización de Regulación DeFi 2025: Ley Fintech 2.0 y Estándares Globales",
    "autor": "Área Legal",
    "fecha": "2025-11-10",
    "imagen": "/images/defi-regulations.png",
    "tags": [
      "DeFi",
      "Regulación",
      "Legal"
    ],
    "contenido": "# Regulación DeFi: Navegando las Aguas Legales en 2025\n\nEl 2025 ha marcado un punto de inflexión para la industria. Durante años, DeFi (Finanzas Descentralizadas) operó en una zona gris. Hoy, con la implementación de nuevos marcos regulatorios a nivel global y local, las reglas del juego están cambiando. Para los desarrolladores y usuarios mexicanos, entender la \"Ley Fintech 2.0\" es vital.\n\n## El Contexto Global: MiCA y GAFI\n\nEuropa marcó la pauta con la implementación total de **MiCA (Markets in Crypto-Assets)** en 2024. Este reglamento ha obligado a los emisores de stablecoins a mantener reservas líquidas 1:1 auditadas. México, siguiendo las recomendaciones del **GAFI (Grupo de Acción Financiera Internacional)**, ha comenzado a alinear sus normativas.\n\n## Situación en México: Hacia la Claridad Fiscal\n\nLa actualización regulatoria de este año en México se centra en tres pilares, según lo discutido en el reciente *Fintech Summit Americas 2025*:\n\n### 1. Fiscalización de Staking y Yield\nEl SAT ha emitido criterios más claros. Los ingresos derivados del *staking* o *yield farming* ahora deben declararse de manera similar a los intereses financieros, separando la ganancia de capital del activo principal.\n\n### 2. KYC en Protocolos (El gran debate)\nSe está discutiendo la implementación de pruebas de identidad (KYC) no invasivas para interactuar con ciertos pools de liquidez regulados. Proyectos como **Aave Arc** ya exploraron esto, y parece ser el camino para atraer capital institucional (fondos de pensiones, bancos) a DeFi.\n\n### 3. DAOs como Personas Jurídicas\nUna propuesta legislativa busca otorgar reconocimiento legal limitado a las Organizaciones Autónomas Descentralizadas (DAOs), permitiéndoles firmar contratos y poseer activos en el mundo real (Real World Assets) bajo una figura similar a las cooperativas digitales.\n\n> \"La regulación no busca matar a DeFi, sino integrarlo de manera segura a la economía global. La resistencia a la censura debe convivir con la prevención del lavado de dinero.\"\n\nComo comunidad universitaria, nuestra postura es clara: abogamos por una regulación inteligente que proteja al usuario sin asfixiar la innovación tecnológica.\n\n### Fuentes Legales y Noticias\n*   [Informe Fintech México 2025](https://www.fintechmexico.org/)\n*   [Reglamento MiCA (Unión Europea)](https://www.esma.europa.eu/esmas-activities/digital-finance-and-innovation/markets-crypto-assets-regulation-mica) (Referencia global)"
  },
  {
    "id": "year-review-2025",
    "titulo": "Resumen del Año: Adopción Blockchain rompe barreras en 2025",
    "autor": "Editorial CriptoUNAM",
    "fecha": "2025-12-28",
    "imagen": "/images/year-review-2025.png",
    "tags": [
      "Análisis",
      "Adopción",
      "Resumen"
    ],
    "contenido": "# 2025: El Año en que Crypto se hizo Invisible\n\nAl mirar atrás, el 2025 será recordado no por un mercado alcista eufórico, sino por algo más importante: la **invisibilidad de la tecnología**. Finalmente, las aplicaciones Web3 empezaron a sentirse como aplicaciones normales, eliminando la fricción que detenía la adopción masiva.\n\n## Cifras que definieron el año\n\n### 1. Stablecoins > Visa\nSegún datos recientes de **TRM Labs** y **Chainalysis**, el volumen de transacciones en stablecoins (USDT, USDC, PYUSD) superó los **$4 trillones de dólares** en la primera mitad de 2025, rivalizando con redes de pago tradicionales como Visa. La narrativa cambió de \"especulación\" a \"utilidad de pagos\".\n\n### 2. Instituciones \"On-Chain\"\nMás de 50 empresas del Fortune 100 ahora corren algún tipo de nodo o infraestructura blockchain. La tokenización de activos del mundo real (RWA) —como bonos del tesoro y bienes raíces— alcanzó los $100 mil millones en TVL (Total Value Locked).\n\n### 3. Layer 2 es el Estándar\nInteractuar directamente con Ethereum Mainnet es cosa del pasado para el usuario promedio. Redes como **Arbitrum**, **Optimism** y **Base** procesaron el 95% de las transacciones, con costos de gas inferiores a $0.01 centavos. La actualización *Dencun* de 2024 rindió sus frutos este año.\n\n## El fin de \"Crypto\" como nicho\n\nYa no hablamos de \"Crypto Twitter\" o \"Crypto Gaming\". Hablamos de Finanzas y Videojuegos. Los juegos Web3 lanzados este año priorizaron la diversión sobre los incentivos económicos, atrayendo a millones de *gamers* que ni siquiera saben que están usando una wallet.\n\n> \"La tecnología es verdaderamente transformadora cuando se vuelve aburrida e invisible.\"\n\nEl 2025 probó que la infraestructura está lista. El 2026 será sobre las aplicaciones sociales y de consumo que se montarán sobre ella.\n\n### Informes de Industria\n*   [Precedence Research: Blockchain Market Size 2025](https://www.precedenceresearch.com/blockchain-technology-market)\n*   [TRM Labs: Crypto Illicit Finance Report 2025](https://www.trmlabs.com/)"
  },
  {
    "id": "trends-watch-2026",
    "titulo": "Tendencias a Observar en 2026: IA Descentralizada y Abstracción Total",
    "autor": "Vitalik Fan",
    "fecha": "2026-01-05",
    "imagen": "/images/trends-2026.png",
    "tags": [
      "Tendencias",
      "Futuro",
      "AI"
    ],
    "contenido": "# Predicciones 2026: La Convergencia Tecnológica\n\n¿Qué sigue después de un año de adopción institucional? Para el 2026, las tendencias apuntan a una fusión profunda entre tecnologías emergentes. Ya no veremos a Blockchain, Inteligencia Artificial y IoT como silos separados, sino como capas de un mismo stack tecnológico descentralizado.\n\n## 1. DeAI (Decentralized AI)\nLa gran narrativa del 2026 será la **Inteligencia Artificial Descentralizada**.\nActualmente, la IA está controlada por un puñado de gigantes tecnológicos. DeAI propone:\n*   **Mercados de Cómputo:** Usar GPUs ociosas de usuarios en todo el mundo para entrenar modelos (tipo Render o Akash, pero para training).\n*   **Provably Fair AI:** Usar criptografía (ZKML - Zero Knowledge Machine Learning) para verificar que un modelo de IA no ha sido manipulado y que el output proviene del input correcto.\n*   **Data DAOs:** Usuarios que son dueños de sus datos y cobran regalías cuando las IAs aprenden de ellos.\n\n## 2. Abstracción de Cuenta (Account Abstraction) Total\nLa frase *\"Not your keys, not your coins\"* evolucionará. La gestión de llaves privadas (las 12 palabras) desaparecerá para el usuario final.\n*   Reglas como el estándar **ERC-4337** permitirán recuperación social (tus amigos pueden ayudarte a recuperar tu cuenta si pierdes el acceso) y autenticación biométrica (FaceID) directa en la blockchain.\n*   Las *Smart Accounts* serán el estándar por defecto.\n\n## 3. Identidad Soberana y Privacidad\nCon el avance de las IAs generativas y los Deepfakes, verificar \"quién es humano\" será el caso de uso más importante. Protocolos como **World ID** o soluciones basadas en *Web of Trust* se volverán infraestructura crítica para navegar internet.\n\n> \"El 2026 no se tratará de comprar monedas, sino de reclamar nuestra soberanía digital en la era de la Inteligencia Artificial.\"\n\nPrepárate, estudia y construye. Las herramientas nunca han sido tan poderosas como ahora.\n\n### Lecturas Futuras\n*   [Messari Crypto Theses 2026 (Proyección)](https://messari.io/)\n*   [Vitalik Buterin: The Convergence of AI and Crypto](https://vitalik.eth.limo/general/2024/01/30/cryptoai.html)"
  }
]